<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;
use Illuminate\Support\Str;

class CitiesTableSeeder extends Seeder
{
    public function run()
    {
        $cities = [
'Москва', 
'Санкт‑Петербург', 
'Новосибирск', 
'Белгород', 
'Нижний Новгород', 
'Екатеринбург', 
'Самара', 
'Омск', 
'Казань', 
'Челябинск', 
'Ростов‑на‑Дону', 
'Донецк', 
'Луганск', 
'Уфа', 
'Волгоград', 
'Пермь', 
'Красноярск', 
'Саратов', 
'Воронеж', 
'Тольятти', 
'Краснодар', 
'Ульяновск', 
'Ижевск', 
'Ярославль',
 'Барнаул', 
'Иркутск', 
'Владивосток', 
'Хабаровск', 
'Новокузнецк', 
'Оренбург', 
'Рязань', 
'Пенза', 
'Тюмень', 
'Набережные Челны',
 'Астрахань',
  'Липецк', 
 'Томск', 
 'Кемерово', 
 'Тула', 
 'Махачкала', 
 'Киров', 
'Чебоксары', 
'Иваново', 
'Брянск', 
'Калининград',
 'Магнитогорск', 
'Курск',
 'Тверь',
 'Нижний Тагил',
 'Улан‑Удэ', 
'Архангельск', 
'Ставрополь', 
'Курган',
            
        ];

        foreach ($cities as $name) {
            DB::table('cities')->insert([
                'name' => $name,
                'slug' => Str::slug($name),
                'verified' => 'confirmed',
                'created_at' => now(),
                'updated_at' => now(),
            ]);
        }
    }
}
