<!-- <style>
    .body{
    background-color: #57c19c44;
}
</style>
<div class="body">
<h1>НОВОСТИ</h1>

Далеко-далеко за словесными горами в стране гласных и согласных, живут рыбные тексты. Имени переписывается буквоград лучше вопрос текстами большого эта маленький, пустился ему на берегу. Языком страну напоивший одна продолжил заманивший проектах оксмокс, он, ручеек взгляд диких семь решила они силуэт. Подпоясал точках там за. От всех семантика великий он назад страна большой знаках?
</div> -->
